cmsis-svd/cmsis-svd/data/Microchip/ATSAME70N.svd
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <name>GMAC_ST2RPQ[%s]</name>
               <description>Screening Type 2 Register Priority Queue (index = 0) 0</description>
               <addressOffset>0x540</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>QNB</name>
                     <description>Queue Number (0-2)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>VLANP</name>
                     <description>VLAN Priority</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>VLANE</name>
                     <description>VLAN Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2ETH</name>
                     <description>Index of Screening Type 2 EtherType register x</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>ETHE</name>
                     <description>EtherType Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>COMPA</name>
                     <description>Index of Screening Type 2 Compare Word 0/Word 1 register x</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>COMPAE</name>
                     <description>Compare A Enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>COMPB</name>
                     <description>Index of Screening Type 2 Compare Word 0/Word 1 register x</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>COMPBE</name>
                     <description>Compare B Enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>COMPC</name>
                     <description>Index of Screening Type 2 Compare Word 0/Word 1 register x</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>COMPCE</name>
                     <description>Compare C Enable</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <name>GMAC_IERPQ[%s]</name>
               <description>Interrupt Enable Register Priority Queue (index = 1) 0</description>
               <addressOffset>0x5FC</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RCOMP</name>
                     <description>Receive Complete</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXUBR</name>
                     <description>RX Used Bit Read</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RLEX</name>
                     <description>Retry Limit Exceeded or Late Collision</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TFC</name>
                     <description>Transmit Frame Corruption Due to AHB Error</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCOMP</name>
                     <description>Transmit Complete</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ROVR</name>
                     <description>Receive Overrun</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HRESP</name>
                     <description>HRESP Not OK</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <name>GMAC_IDRPQ[%s]</name>
               <description>Interrupt Disable Register Priority Queue (index = 1) 0</description>
               <addressOffset>0x61C</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RCOMP</name>
                     <description>Receive Complete</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXUBR</name>
                     <description>RX Used Bit Read</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RLEX</name>
                     <description>Retry Limit Exceeded or Late Collision</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TFC</name>
                     <description>Transmit Frame Corruption Due to AHB Error</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCOMP</name>
                     <description>Transmit Complete</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ROVR</name>
                     <description>Receive Overrun</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HRESP</name>
                     <description>HRESP Not OK</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <name>GMAC_IMRPQ[%s]</name>
               <description>Interrupt Mask Register Priority Queue (index = 1) 0</description>
               <addressOffset>0x63C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RCOMP</name>
                     <description>Receive Complete</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXUBR</name>
                     <description>RX Used Bit Read</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RLEX</name>
                     <description>Retry Limit Exceeded or Late Collision</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AHB</name>
                     <description>AHB Error</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCOMP</name>
                     <description>Transmit Complete</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ROVR</name>
                     <description>Receive Overrun</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HRESP</name>
                     <description>HRESP Not OK</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>GMAC_ST2ER[%s]</name>
               <description>Screening Type 2 Ethertype Register (index = 0) 0</description>
               <addressOffset>0x6E0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>COMPVAL</name>
                     <description>Ethertype Compare Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_ST2CW00</name>
               <description>Screening Type 2 Compare Word 0 Register (index = 0)</description>
               <addressOffset>0x700</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>MASKVAL</name>
                     <description>Mask Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>COMPVAL</name>
                     <description>Compare Value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_ST2CW10</name>
               <description>Screening Type 2 Compare Word 1 Register (index = 0)</description>
               <addressOffset>0x704</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>OFFSVAL</name>
                     <description>Offset Value in Bytes</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>OFFSSTRT</name>
                     <description>Ethernet Frame Offset Start</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>OFFSSTRTSelect</name>
                        <enumeratedValue>
                           <name>FRAMESTART</name>
                           <description>Offset from the start of the frame</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ETHERTYPE</name>
                           <description>Offset from the byte after the EtherType field</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IP</name>
                           <description>Offset from the byte after the IP header field</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCP_UDP</name>
                           <description>Offset from the byte after the TCP/UDP header field</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_ST2CW01</name>
               <description>Screening Type 2 Compare Word 0 Register (index = 1)</description>
               <addressOffset>0x708</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>MASKVAL</name>
                     <description>Mask Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>COMPVAL</name>
                     <description>Compare Value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_ST2CW11</name>
               <description>Screening Type 2 Compare Word 1 Register (index = 1)</description>
               <addressOffset>0x70C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>OFFSVAL</name>
                     <description>Offset Value in Bytes</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>OFFSSTRT</name>
                     <description>Ethernet Frame Offset Start</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>OFFSSTRTSelect</name>
                        <enumeratedValue>
                           <name>FRAMESTART</name>
                           <description>Offset from the start of the frame</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ETHERTYPE</name>
                           <description>Offset from the byte after the EtherType field</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IP</name>
                           <description>Offset from the byte after the IP header field</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCP_UDP</name>
                           <description>Offset from the byte after the TCP/UDP header field</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_ST2CW02</name>
               <description>Screening Type 2 Compare Word 0 Register (index = 2)</description>
               <addressOffset>0x710</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>MASKVAL</name>
                     <description>Mask Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>COMPVAL</name>
                     <description>Compare Value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_ST2CW12</name>
               <description>Screening Type 2 Compare Word 1 Register (index = 2)</description>
               <addressOffset>0x714</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>OFFSVAL</name>
                     <description>Offset Value in Bytes</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>OFFSSTRT</name>
                     <description>Ethernet Frame Offset Start</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>OFFSSTRTSelect</name>
                        <enumeratedValue>
                           <name>FRAMESTART</name>
                           <description>Offset from the start of the frame</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ETHERTYPE</name>
                           <description>Offset from the byte after the EtherType field</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IP</name>
                           <description>Offset from the byte after the IP header field</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCP_UDP</name>
                           <description>Offset from the byte after the TCP/UDP header field</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_ST2CW03</name>
               <description>Screening Type 2 Compare Word 0 Register (index = 3)</description>
               <addressOffset>0x718</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>MASKVAL</name>
                     <description>Mask Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>COMPVAL</name>
                     <description>Compare Value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_ST2CW13</name>
               <description>Screening Type 2 Compare Word 1 Register (index = 3)</description>
               <addressOffset>0x71C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>OFFSVAL</name>
                     <description>Offset Value in Bytes</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>OFFSSTRT</name>
                     <description>Ethernet Frame Offset Start</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>OFFSSTRTSelect</name>
                        <enumeratedValue>
                           <name>FRAMESTART</name>
                           <description>Offset from the start of the frame</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ETHERTYPE</name>
                           <description>Offset from the byte after the EtherType field</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IP</name>
                           <description>Offset from the byte after the IP header field</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCP_UDP</name>
                           <description>Offset from the byte after the TCP/UDP header field</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_ST2CW04</name>
               <description>Screening Type 2 Compare Word 0 Register (index = 4)</description>
               <addressOffset>0x720</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>MASKVAL</name>
                     <description>Mask Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>COMPVAL</name>
                     <description>Compare Value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
